backend/app/models/ingredient.rb

  def preferred_measure
    Measure.find(self.preferred_measure_id).measure
---
SELECT  "measures".* FROM "measures" WHERE "measures"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]