backend/app/controllers/ingredients_controller.rb

  def index
    render json: Ingredient.all
---
SELECT "ingredients".* FROM "ingredients"

  def update
    ingredient = Ingredient.find(params[:id])

    puts "params: #{params}"
    ingredient.update(ingredient_params)
---
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "ingredients" SET "preferred_measure_id" = ?, "updated_at" = ? WHERE "ingredients"."id" = ?  [["preferred_measure_id", 64], ["updated_at", "2020-10-04 16:26:38.117420"], ["id", 74]]