backend/app/controllers/measures_controller.rb

SELECT "measures".* FROM "measures"
---
  def index
    render json: Measure.all

SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."name" = ? LIMIT ?  [["name", "All Purpose Flour"], ["LIMIT", 1]]
---
  def show
    ingredient = params[:id].split('-').join(' ')
    measure = Ingredient.find_by(name: ingredient)

INSERT INTO "measures" ("measure", "created_at", "updated_at") VALUES (?, ?, ?)  [["measure", "New measure"], ["created_at", "2020-10-02 02:07:41.096654"], ["updated_at", "2020-10-02 02:07:41.096654"]]
---
  def create
    measure = Measure.create(params[:measure])