backend/app/controllers/quantities_controller.rb

  def index
    render json: Quantity.all
---
SELECT "quantities".* FROM "quantities"

  def create
    quantity = Quantity.create(quantity_params)
---
INSERT INTO "quantities" ("quantity", "created_at", "updated_at") VALUES (?, ?, ?)  [["quantity", "1"], ["created_at", "2020-10-04 14:22:21.437498"], ["updated_at", "2020-10-04 14:22:21.437498"]]